import 'package:hospitalapp/src.dart';

class homeicons {
  // static final kSampleIcons = [
  //   Icons.track_changes_outlined,
  //   Icons.receipt_long_outlined,
  //   Icons.wifi_protected_setup_outlined,
  //   Icons.add_to_home_screen_outlined,
  //   Icons.account_box_outlined,
  // ];
  // static final kSampleIconLabels = [
  //   'Khuyến mãi',
  //   'Lịch sử',
  //   'Chuyển tiền',
  //   'Nạp tiền',
  //   'Tài khoản',
  // ];
  static final List<OnBoardingModel> appareimage = [
    OnBoardingModel(image:ImageAssets.appareimage1,body: "قسم العمليات"),
    OnBoardingModel(image:ImageAssets.appareimage2,body: "قسم الجهاز التنفسي"),
    OnBoardingModel(image:ImageAssets.appareimage3,body: "قسم الباطنية "),
    OnBoardingModel(image:ImageAssets.appareimage4,body: "قسم العين"),
    OnBoardingModel(image:ImageAssets.appareimage5,body: "قسم الاطفال"),
    OnBoardingModel(image:ImageAssets.appareimage6,body: "قسم جراحة المخ ")
  ];
     static final List body = ["""
جناح العمليات عبارة عن غرف لإجراء عمليات معقدة يصعب إجراءها بعملية بسيطة، باختلاف باقي الوحدات والأقسام فإن غرف العمليات تكون عامة لمختلف الاختصاصات .
يجب أن تخصص مساحة خاصة لجناح العمليات وذلك من أجل تحقيق النظام المغلق وحسن الإدارة والعناية وعدم التلوث، أن حجم غرفة العمليات تختلف من محل إلى آخر فمثلا فى المشافى التعليمية مساحتها بين 28–46 م وإن الحجم المتوسط لغرفة العمليات هى من 25–30م وتكون ذات أشكال مختلفة فيمكن أن تكون مستطيلة أو مربعة أو بيضاوية المسقط لاحظ الشكل.
عند التصميم يجب مراعاة الأتي:-
1)- اشتراك كل غرفتي عمليات بأجهزة مشتركة .
2)- الارتفاع الأساسي لغرفة العمليات من 4-4.5 م.
من الناحية الميكانيكية يجب أن تكون غرفة العمليات تحت تأثير ضغط الهواء الموجب بحيث أن الهواء يتعرض للخروج وليس للدخول إلى الغرفة وذلك لأن الهواء الداخلي معالج وأن الهواء الخارجي لم يتعرض للمعالجة .
3) أن غرفة العمليات عديمة النوافذ وتعتمد اعتمادا كليا على الإضاءة الصناعية والتهوية الميكانيكية .
عند تصميم أجنحة العمليات يجب أن لا يكون الجناح ممرا للعناصر الأخرى ففي المستشفيات الكبيرة
4) ربما يحتل جناح العمليات طابقا منفردا ، أما فى المستشفيات الصغيرة فربما يحتل نهاية جناح من الأجنحة يجاور جناح العمليات المصاعد ، ووحدة التمريض للجراحة وكذلك يكون له علاقة بجناح الإسعاف أو الطوارئ كما يحتاج أيضا إلى قسم الأشعة .
يحتوى جناح العمليات على قسمين منفصلين للجراحة النظيفة .
5) جميع السطوح والمواد فى جناح العمليات يجب أن تكون قابلة للتنظيف يجب أن تكون محكمة الإغلاق وأن تكون الأرض ثابتة وعازلة كهربائياً.
6) تحليل الحركة فى جناح العمليات
1- خط حركة المريض فى جناح العمليات .
دخوله إلى جناح العمليات –التحذير – العمليات – الإنعاش – الخروج
2) خط حركة الأطباء والممرضات .
السيطرة – التعقيم – غرفة العمليات
هنالك عدة أنواع للحركة فى قسم العمليات حيث أن موضوع الحركة مهم جدا في التصميم وهنالك قاعدتين يمكن الاعتماد عليها:
1- الممر الوحيد حين يصل هذا الممر غرف العمليات بغرف التخديم .
2- الممر المزدوج وهو عبارة عن حركة حلقية حول أجنحة العمليات . لاحظ الشكل
قسم الأشعة :
أن قسم الأشعة مكون من أربعة أقسام

ب- التشخيص بالتصوير الشعاعي .
ج- العلاج الشعاعي .
د- التصوير المقطعي .
أن الأقسام الذكورة يمكن جميعا مع بعض ويمكن أن تكون مفصولة .
1- التشخيص بالتصوير الشعاعي
وهو عبارة عن أخذ صور داخلية للمريض ، عند تصميم قسم التصوير الشعاعي يجب أن يكون مسار المريض منفصل عن مسار الفنيين ويجب أن يراعى في التصميم سهولة وصول المرضى المحمولين على الأسرة ، وأن تكون المسافة التي يقطعها التقني بين غرفة التصوير وعملية تحميض الأفلام قريبة جدا .
غرفة الأشعة يجب أن تكون معزولة عن باقي أقسام المستشفى بطبقة معدنية من ألواح الرصاص أو معدن الباريوم ، ارتفاع غرفة الأشعة من 3-4 م والباب يجب أن يكون من درفتين أبعدها 90 و 50 سم .
أن لقسم التشخيص الشعاعي عدة أشكال فيمكن أن يكون على مشكل متصالب أو على شكل حرف u أو على أشكال مختلفة.
ب- العلاج الشعاعي :
وهو القسم المخصص للعلاج بالأشعة وبسبب الكمية الكبيرة للأشعة المنطلقة للعلاج فلذلك وجب أن يكون هذا القسم معزول بشكل مطلق وبعض القوانين تفرض وجود هذا القسم فى الطوابق السفلية ويجب أن تكون مصممة من البتون المسلح (السقف الجدران الأرضية) وأن تزود بتصريف خاص للفضلات وأن إغلاق وفتح الأبواب يجب أن يتم التحكم بها بشكل مركزي من غرفة مجاورة.
ج- الطب النووي :
هو عبارة عن مكان للتشخيص المرضى الذي يتم بحقن المريض بمواد مشعة ومتابعة سيرها بواسطة أجهزة تليفزيونية متطورة. وغرف هذا القسم يجب أن تكون معزولة وكبيرة لمرور السديات وهى لا تأخذ مساحة كبيرة كبقية للأقسام ففي هذا القسم يمكن وضع عدة مرضى فى آن واحد ويجب مراعاة وجود غرف تخزين ملحقة بهذا القسم .
""",
    """يعتبر قسم الأمراض الصدرية والمعالجة التنفسية من الأقسام الرائدة والمتميزة في المستشفى التخصصي حيث يضم نخبة متميزة من استشاريي الأمراض الصدرية والعناية الحثيثة وأمراض النوم بالإضافة إلى كادر فني متميز ومتخصص.

الخدمات التي يقدمها القسم:

علاج وتشخيص الربو وتضيق القصبات الهوائية
علاج وتشخيص مرض انسداد الرئوي المزمن
علاج الجلطات الرئوية الحادة
علاج وتشخيص أمراض التليف الرئوي
علاج سرطان الرئة
علاج ارتفاع ضغط الشريان الرئوي
علاج الالتهابات الرئوية و الامراض المعدية
مختبر معالجة اضطرابات النوم ومن خلاله يتم إجراء دراسة للنوم وتشخيص أمراض النوم وتحديد خطة العلاج المناسبة
وحدة العناية الحثيثة والإشراف على مرضى التنفس الاصطناعي حيث يحتوي المستشفى على 14 جهاز تنفس اصطناعي للبالغين و 7 أجهزة لحديثي الولادة
تنظير القصبات والشعب الهوائية وممكن خلالها أخذ عينات للتحليل وإجراء خزعات للرئتين من خلال التنظير
فحص وظائف الرئتين
فحص غازات الدم
المعالجة بالاكسجين والتباخير العلاجية
بزل الجنب في حالات الارتشاح الرئوي
العلاج الطبيعي التنفسي بعد العمليات الجراحية
"""
,
"""
أخصائيو الطب الباطني هم أطباء متخصصون مدرَّبون على التعامل خصيصًا مع الحالات المعقدة أو الأمراض الجهازية المتعددة التي قد لا يكون الطبيب المتخصص في علاج أمراض العضو الواحد غير مدرب على التعامل معها. قد يُطلب منهم التدخل في الحالات ذات الأعراض غير المتمايزة التي لا يمكن للطبيب المتخصص في أمراض العضو الواحد التعامل معها، مثل ضيق النفس، أو الإعياء، أو فقد الوزن، أو ألم الصدر، أو الارتباك، أو التغير في درجة الوعي. يمكنهم كذلك علاج حالات المرض الحادة الخطيرة التي تؤثر على أجهزة مختلفة في نفس الوقت، كما يمكنهم إدارة الأمراض المزمنة المتعددة في مريض واحد أو ما يعرف بـ«المراضة المشتركة».

الأطباء المتخصصون في الطب الباطني العام ليسوا بالضرورة أقل خبرة من أخصائيي العضو الواحد، بل مدربون على دور محدد للعناية بالمرضى أصحاب المشاكل المتعددة المتزامنة أو أصحاب المراضات المشتركة المعقدة.

ربما لأنه من المعقد شرح علاج الأمراض غير المحدودة لعضو واحد، تسبب ذلك في ارتباك بشأن معنى الطب الباطني ودور الطبيب الباطني. الأطباء الباطنيون "Internists" هم أطباء مؤهلون مع دراسات عليا وتدريب في مجال الطب الباطني ويجب عدم الخلط بينهم وبين الأطباء تحت التدريب "Interns" وهم الأطباء في السنة الأولى من تدريب الإقامة. رغم أن الطبيب الباطني قد يتعامل مثل أطباء الرعاية الصحية الأولية، إلا أنه ليس «طبيب الأسرة»، ولا «طبيب عام»، والذين لا يشمل تدريبه البالغين فقط وقد يشمل الجراحة، وطب التوليد، وطب الأطفال. تعرف كلية الأطباء الأمريكية أطباء الباطنة على أنهم «أطباء يتخصصون في منع، واكتشاف، وعلاج الأمراض في البالغين».


يزاول الأطباء الباطنيون عملهم في العيادات والمستشفيات، في نفس اليوم غالبًا. إلا أن ضغط الوقت اضطر العديد منهم لاختيار مكان واحد للعمل إما المستشفى، أو العيادة الخارجية.

"""
,
    """حيث نقوم سنوياً بعلاج أكثر من 6000 مريض داخلي وحوالي 25000 مريض من العيادة الخارجية.
   كما نقوم بإجراء اكثر من 7000 عملية جراحية في العام، تبدأ من جراحة الماء الابيض الكاتاراكت والماء الأزرق الجلوكوما وحتى جراحات الشبكية لتصل 
   إلى جراحات الجهاز الدمعي وجراحات تصحيح إخطاء العيون وزراعة القرنية. 
    نحن نفحص أخطاء العيون ونقوم بإجراء جراحات تجميلية، على سبيل المثال جراحات لتصحيح الأوضاع الخاطئة للجفون والجفن المعلق. وبالتعاون مع شريك خارجي نقدم العلاج بالليزر لتصحيح إخطاء الرؤية. بناء على الحجم الكبير لمنشأتنا نستطيع تقديم المتخصصين في جميع نواحي العلم الذين لا يتمتعون فقط بالخبرة الطبية، بل يهتمون أيضاً علمياً بجميع الاستفسارات في مجال تخصصهم. 
هم موضوعات البحث هي تطوير أساليب حديثة لتصحيح أخطاء الرؤية (على سبيل المثال زراعة العدسات الحيدية وتحليل أساليب الليزر). أما في مجال الجلوكوما (الماء الزرقاء) فنقوم بتحليل انتشار الدم في العين ونختبر أساليب علاج جراحية جديدة. بخلاف ذلك نعمل على تثبيت طرق علاج جديدة لمعالجة أمراض الشبكية. وفي هذا الصدد يقوم علمائنا بتطوير شريحة إلكترونية للشبكية ويقومون بأعمال تجريبية على الخلايا الجذعية التي من المحتمل أن تحل محل الخلايا الحسية المريضة في يوم من الأيام.
"""
,
"""
يعمل قسم الاطفال في مستشفى المقاصد كمركزمتعدد للخدمات الطبية من اجل تشخيص وعلاج الامراض المزمنة والحادة. 

تم تاسيس قسم الاطفال قي السبعينيات من القرن الماضي كجناح صغير قي المستشفى اذ احتوى على عدد قليل من الاسرة ونشاطه الرئيسي ارتكز على علاج الاطفال الذين تم ادخالهم الى المستشقى ومصابين بامراض معدية ومزمنة مثل فقر الدم والتهاب السحايا او امراض التهاب الامعاء والمعدة. 

وعبر السنوات كان هناك توسع ونمو ثابت ومستمر للقسم لتلبية الحاجات المتزايدة للمجتمع القلسطيني ، وهذا تضمن توسيع الخدمات في الجناح العام للاطفال ، افتتاح وحدة الاطفال الخدج وكذلك رفع درجة الخدمة في وحدة العناية المكثفة للاطفال وفي وحدة العناية المكثفة لمرضى القلب من الاطفال وفي العيادات الخارجية التابعة لقسم الاطفال.

وبشكل متوازي مع هذه التطورات ، فقد تم استحداث تخصصات فرعية في  قسم الاطفال يحتاجها الاطفال الفلسطينون بشكل كبير وهي غير متوفرة في اماكن اخرى في فلسطين.

يعتبر توفر الفحوصات التشخيصية ووسائل العلاجية  من الافضل في العالم. يعمل الموظفين في القسم  مع الاطباء المقيمين  وطاقم التمريض  بانسجام تام مع باقي التخصصات في المستشفى مثل جراحة الاطفال والعظام وجراحة القلب والصدر والمسالك وجراحة الاعصاب.

ومن اللافت للنظر ان اسلوب تعدد الخدمات الطبية المقدم للمرضى من قبل الاطباء ، يقدم ايضا من طواقم التمريض في المستشفى 

يعمل في قسم الاطفال الان اطباء اطفال اختصاصيون بالاضافة الى اطباء اختصاصيون في التخصصات الفرعية التالية: 

1- طبابة الاطفال جديثي الولادة.

2- قلب الاطفال.

3-الغدة الدرقية عند الاطفال.

4- اعصاب الاطفال.

5-امراض الايض عند الاطفال خدمات سريرية ومخبرية.

6- الامراض الوراثية عند الاطفال خدمات سريرية ومخبرية ايضا.

سيتم في القريب العاجل تقديم خدمات جديدة لقسم الاطفال مثل امراض رئتي الاطفال وكذلك الامراض الباطنية عندهم.ويوجد الان طبيبان فلسطينيان يتخصصان بهذه التخصصات في الولايات المتحدة الامريكية. يعمل في قسم الاطفال ايضا طاقم تمريضي متعدد ومؤهل. ويتميز قسم الاطفال بالعلاقة الدافئة التي تربط الموظفين مع بعضهم البعض من جهة ومع المرضى وذويهم من جهة اخرى. 

النشاطات التعليمية والتدريبية للقسم: 

يدير قسم الاطفال برنامجا تعليميا للاطباء المقيمين اللذين يتخصصون في قسم الاطفال. وهذا البرنامج يمتد الى اربع سنوات ومعترف به من قبل مجلسي الطب الاردني والفلسطني. لقد تم تاسيسه في عام 1988 ويتم تخريج طبيبان الى ثلاثة اطباء سنويا اللذين يستطيعون اجتياز الامتحانات بكل يسر وسهولة.بالاضافة الى ذالك ، فان قسم الاطفال في المستشفى مرتبط ومنتظم في العمل مع كلية الطب في جامعة القدس بحيث يعمل الاطباء الاختصاصيون كمحاضرين في الجامعة .
"""
,
"""

لدكتور ف. ك. جين هو المدير الأول لجراحة الأعصاب في ماكس للرعاية الصحية ، دلهي. شهدت خبرته المهنية التي امتدت لسنوات عديدة في العديد من الأدوار البارزة في المستشفيات في جميع أنحاء العالم. طور أفضل جراحي الأعصاب في دلهي تقنية جراحية أصلية. كان الدكتور جاين مدرسًا محترمًا وباحثًا ومسؤولًا في العديد من المعاهد المرموقة في الهند والخارج. أعلى جراح الأعصابفي دلهي ، أكملت الهند درجة ایم بی بی ایسوشهادة الماجستير في جراحة الأعصاب. بعد العمل لمدة عشر سنوات في نيمهان ، انتقل بنجالور إلى معهد الدراسات العليا في سانجايا غاندي للعلوم الطبية في لكناو. هنا كان لأفضل جراح أعصاب في الهند دور فعال في إنشاء قسم جديد وبناءه وفقًا لمستوى عالٍ من خدمات البحوث والتعليم ، مما أدى إلى ظهور الهند في الخارج وحالتها المتميزة. غادر كبار جراحي الأعصاب في الهند هذا المعهد للانضمام إلى مستشفى سير جانجا رام في نيودلهي كرئيس لقسم جراحة المخ والأعصاب ثم انتقل إلى مستشفى ماكس سوبر التخصصي في ساكيت كمدير أول لجراحة الأعصاب وجراحة العمود الفقري. أفضل جراح أعصاب في العالم لا يترك أي حجر لم ينقض لصالح المرضى. استشر دكتور V. K. جاين لجراحة الأعصاب في مستشفى ماكس في دلهي عبر رقم الاتصال الوارد على موقعنا.

أفضل دكتور في جراحة الأعصاب في ماكس للرعاية الصحية في دلهي ، عمل الدكتور جاين أيضًا كأستاذ مشارك خاص في قسم جراحة الأعصاب في جامعة فوجيتا الصحية ، ناغويا ، اليابان لمدة عام. كما كان أفضل طبيب لجراحة الأعصاب في الهند أستاذًا زائرًا في مختلف أقسام جراحة الأعصاب في الجامعات بالخارج وممتحنًا للمجلس الوطني للامتحانات (ڈی این بی) وللحصول على درجة الماجستير في جراحة الأعصاب في العديد من الجامعات. درب الدكتور دكتور ف. ك جاين نفسه حوالي 100 جراح أعصاب. وقد قدم العديد من الأوراق في المؤتمرات العلمية الوطنية والدولية ، وهو مدعو بانتظام لإلقاء محاضرات في مختلف سی ایم ای (برامج التعليم الطبي المستمر) والتحديثات من قبل المنظمات العلمية المختلفة في الهند والخارج. كان أفضل جراح أعصاب في ماكس الرعاية الصحية في هيئة تحرير المجلات المرموقة على سبيل المثال. العمود الفقري وطب الأعصاب في الهند ومجلة طب الدراسات العليا والمجلة الهندية للورم العصبي. لدى الدكتور جاين العديد من المنشورات العلمية في المجلات والكتب الوطنية والدولية. أرسل لنا استفسارك لحجز موعد عبر الإنترنت عبر دكتور ف. ك. جاين عنوان البريد الإلكتروني.


"""

  ];
}
