
import 'package:hospitalapp/src.dart';
List<latestNewData> latestlist =[
  latestNewData(title: "عشرون عام من التأسيس",image:"assets/images/p4.jpg", text:  "أطلقت قيادة مستشفى أطباء المنار مطلع هذا الأسبوع وهذا العام 2022م، حملة احتفائية واسعة بمناسبة مرور عشرون عاماً من التأسيس تحت شعار  مستمرون بالرعاية", date: "سبت26,2022 "),
  latestNewData(title: "وكيل المحافظة للشؤون الصحية يزور المستشفى",image:"assets/images/p4.jpg", text:  "  وكيل محافظة إب للشؤون الصحية والمنظمات يزور مستشفى أطباء المنار زار وكيل المحافظة لشؤون الصحة والمنظمات الدكتور أشرف المتوكل اليوم مستشفى أطباء الم...", date: "سبت26,2022 "),
  latestNewData(title: "عشرون عام من التأسيس",image:"assets/images/p4.jpg", text:  "أطلقت قيادة مستشفى أطباء المنار مطلع هذا الأسبوع وهذا العام 2022م، حملة احتفائية واسعة بمناسبة مرور عشرون عاماً من التأسيس تحت شعار  مستمرون بالرعاية", date: "سبت26,2022 ")
];